name: "ensemble_model"
platform: "ensemble"
max_batch_size: 0
input [
  {
    name: "ensemble_input"
    data_type: TYPE_FP16
    dims: [1, -1, -1, 3]
  }
]
output [
  {
    name: "ensemble_output"
    data_type: TYPE_FP16
    dims: [1, 1, -1]
  }
]
ensemble_scheduling {
  step [
    {
      model_name: "retina_pre"
      model_version: 1
      input_map {
        key: "input_raw"
        value: "ensemble_input"
      }
      output_map {
        key: "pre_out"
        value: "pre_out"
      } 
    },

    {
      model_name: "retina"
      model_version: 1
      input_map {
        key: "input"
        value: "pre_out"
      }
      output_map {
        key: "output"
        value: "loc"
      }
      output_map {
        key: "781"
        value: "conf"
      }
      output_map {
        key: "780"
        value: "landmarks"
      }
      
    },

    {
      model_name: "retina_post"
      model_version: 1
      input_map {
        key: "img"
        value: "ensemble_input"
      }
      input_map {
        key: "output"
        value: "loc"
      }
      input_map {
        key: "781"
        value: "conf"
      }
      input_map {
        key: "780"
        value: "landmarks"
      }
      output_map {
        key: "bbox"
        value: "ensemble_output"
      }
    }

  ]
}
