name: "retina_pre"
backend: "python"
max_batch_size: 0 
input [
{
    name: "input_raw"
    data_type: TYPE_FP16
    dims: [1, -1, -1, 3]
}
]
 
output [
{
    name: "pre_out"
    data_type: TYPE_FP16
     dims: [1, 3, -1, -1]
}
]

instance_group [{ kind: KIND_CPU }]